Revit 2027 API
BrowserOrganization.GetCurrentBrowserOrganizationForViews Method
 Gets the BrowserOrganization that applies to the Views section of the project browser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BrowserOrganization GetCurrentBrowserOrganizationForViews(
	Document document
)
Public Shared Function GetCurrentBrowserOrganizationForViews (
	document As Document
) As BrowserOrganization
public:
static BrowserOrganization^ GetCurrentBrowserOrganizationForViews(
	Document^ document
)
static member GetCurrentBrowserOrganizationForViews :
        document : Document -> BrowserOrganization
Parameters
document Document
 Revit document from which to get the organization data.
Return Value
BrowserOrganization
 The BrowserOrganization for views, or null if no view sections exist
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace